# Colab 환경

In [ ]:
%load_ext sql

In [ ]:
!pip install SQLAlchemy==1.4.47

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: SQLAlchemy==1.4.47 in /usr/local/lib/python3.10/dist-packages (1.4.47)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from SQLAlchemy==1.4.47) (2.0.2)

In [ ]:
%sql postgresql://admin:Qwer1234@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev

In [ ]:
%%sql

SELECT datname FROM pg_database WHERE datistemplate = false;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
2 rows affected.

[('dev',), ('padb_harvest',)]

In [ ]:
%%sql

select * from pg_user;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
4 rows affected.

[('rdsdb', 1, True, True, True, '********', 'infinity', None),
 ('IAM:RootIdentity', 101, True, True, False, '********', None, None),
 ('admin', 100, True, True, False, '********', 'infinity', None),
 ('team4_2', 102, False, False, False, '********', None, None)]

In [ ]:
%%sql


select * from SVV_ROLES;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
5 rows affected.

[(105245, 'sys:operator', 'rdsdb', None),
 (105246, 'sys:monitor', 'rdsdb', None),
 (105247, 'sys:dba', 'rdsdb', None),
 (105248, 'sys:secadmin', 'rdsdb', None),
 (105249, 'sys:superuser', 'rdsdb', None)]

In [ ]:
%%sql
SELECT * FROM pg_catalog.pg_tables;

In [ ]:
%%sql
SELECT * FROM raw_data.code_detail order by 1 desc LIMIT 20;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
20 rows affected.

[(268, '4', 'CITY', '제주시', '39'),
 (267, '3', 'CITY', '서귀포시', '39'),
 (266, '2', 'CITY', '북제주군', '39'),
 (265, '1', 'CITY', '남제주군', '39'),
 (264, '24', 'CITY', '화순군', '38'),
 (263, '23', 'CITY', '해남군', '38'),
 (262, '22', 'CITY', '함평군', '38'),
 (261, '21', 'CITY', '진도군', '38'),
 (260, '20', 'CITY', '장흥군', '38'),
 (259, '19', 'CITY', '장성군', '38'),
 (258, '18', 'CITY', '완도군', '38'),
 (257, '17', 'CITY', '영암군', '38'),
 (256, '16', 'CITY', '영광군', '38'),
 (255, '13', 'CITY', '여수시', '38'),
 (254, '12', 'CITY', '신안군', '38'),
 (253, '11', 'CITY', '순천시', '38'),
 (252, '10', 'CITY', '보성군', '38'),
 (251, '9', 'CITY', '무안군', '38'),
 (250, '8', 'CITY', '목포시', '38'),
 (249, '7', 'CITY', '담양군', '38')]

In [ ]:
%%sql
drop table IF EXISTS raw_data.AREA_EVENT cascade;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

CREATE TABLE raw_data.AREA_EVENT (
  EVENT_ID varchar(32) PRIMARY KEY,
  EVENT_TITLE varchar(256),
  EVENT_STR_DT TIMESTAMP,
  EVENT_END_DT TIMESTAMP,
  MAP_X FLOAT,
  MAP_Y FLOAT,
  ADDRESS varchar(128),
  CATEGORY varchar(32),
  CODE_SEQ INT,
  FOREIGN KEY (CODE_SEQ) REFERENCES raw_data.code_detail (CODE_SEQ)
);

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

COPY raw_data.AREA_EVENT
FROM 's3://tour-dashboard-4-2/csv_data/AREA_EVENT.csv'
credentials 'aws_iam_role=arn:aws:iam::433690009634:role/redshift.read.s3'
delimiter ',' dateformat 'auto' timeformat 'auto' IGNOREHEADER 1 removequotes;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

SELECT * FROM raw_data.area_tour_facility;

 * postgresql://admin:***@tableau-project-4-2.433690009634.us-west-2.redshift-serverless.amazonaws.com:5439/dev
0 rows affected.

[]